app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.create(comment_params)
        @comment.user = current_user

        if @comment.save
---
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "adsfasdf"], ["post_id", 1], ["user_id", 1], ["created_at", "2022-09-27 09:02:50.390190"], ["updated_at", "2022-09-27 09:02:50.390190"]]
UPDATE "comments" SET "updated_at" = ? WHERE "comments"."id" = ?  [["updated_at", "2022-09-27 06:30:46.421481"], ["id", 1]]