app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments"
---
  def show
    @comments = Comment.all

INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "for testing"], ["description", "f"], ["created_at", "2022-10-02 11:16:42.403550"], ["updated_at", "2022-10-02 11:16:42.403550"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT "users".* FROM "users"
---
def set_user
  @users = User.all